from dotenv import load_dotenv
import os

load_dotenv()
# test = os.getenv('TEST')

db_dir = './findata'
db_name = 'findata.sqlite'

f_report_dir = './f_report'

balance_temp = ['現金及約當現金', '股本合計', '存貨', '流動資產合計', '資產總計',
                '負債總計', '歸屬於母公司業主之權益合計', '非流動資產合計', '非流動負債合計', '流動負債合計',
                '非控制權益', '權益總額', '權益總計', '負債及權益總計']

income_temp = ['營業收入合計', '營業成本合計', '營業毛利毛損', '營業毛利毛損淨額', '繼續營業單位稅前淨利淨損',
               '繼續營業單位本期淨利淨損', '本期淨利淨損', '推銷費用', '管理費用', '研究發展費用',
               '營業費用合計', '基本每股盈餘合計', '稀釋每股盈餘合計', '本期淨利淨損']

cash_temp = ['本期稅前淨利淨損', '利息費用', '利息收入', '股利收入', '營業活動之淨現金流入流出',
             '投資活動之淨現金流入流出', '存貨增加減少', '存貨減少增加之調整數']
